In [23]:
import pandas as pd
import numpy as np

In [24]:
#DataFame 생성하기

df = pd.DataFrame({'food' : ['KFC', 'McDonald','SchoolFood'],
                   'price' : [1000, 2000, 2500],
                   'rating' : [4.5, 3.9, 4.2]})
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [25]:
df[['food', 'rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
4. 방자의 영어 줌수를 80점으로 수정하고 평균 점수도 다시 계산한다.
5. 춘향의 점수를 데이터프레임으로 나타낸다.
6. 향단의 점수를 시리즈로 나타낸다.

In [26]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [27]:
#ex1 
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [28]:
#ex2
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [29]:
#ex3
df["avg"] = ((df["국어"] + df["영어"] + df["수학"]) / 3).round(2)
df

    국어  영어  수학    avg
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [30]:
#ex4
df.loc['방자', '영어'] =80
#df['방자']['영어'] = 80
df["avg"] = round(df.mean(axis=1),2)    #avg를 표현하는 두번째 방법
df

    국어  영어  수학    avg
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  56.67

In [31]:
#ex5
df.loc[['춘향']]

    국어  영어  수학    avg
춘향  80  90  90  86.67

In [32]:
#ex5Ref
df[:1]

    국어  영어  수학    avg
춘향  80  90  90  86.67

In [33]:
#ex6
df.loc['향단']

국어     70.0
영어     60.0
수학     80.0
avg    70.0
Name: 향단, dtype: float64

In [34]:
#ex6Ref
pd.Series(list(df[2:3].values),index = ["향단"])

향단    [70.0, 60.0, 80.0, 70.0]
dtype: object

In [35]:
df.head(3)

    국어  영어  수학    avg
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00

In [36]:
df.head()

    국어  영어  수학    avg
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  56.67

In [37]:
df['국어']

춘향    80
몽룡    90
향단    70
방자    30
Name: 국어, dtype: int64

1. 모든 행과 열에 라벨을 가지는 5 * 5 이상의 크기를 가지는 데이터프레임을 만든다
2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [38]:
row = [1,2,3,4,5]
columns = ['A', 'B', 'C', 'D', 'E']

data = np.random.randn(5,5)
df = pd.DataFrame(data, index=row, columns= columns)
df

          A         B         C         D         E
1  0.353445  0.566313 -1.555943  0.405757  0.520186
2 -0.329803  1.449756 -0.501198 -0.129646 -1.097650
3  0.190020 -0.691334 -2.016615  0.250103  1.639113
4  0.383322  1.420113  2.078265  1.021147 -0.688420
5  0.490292  0.035244  1.044593  2.606854  0.015239

In [39]:
df['A']

1    0.353445
2   -0.329803
3    0.190020
4    0.383322
5    0.490292
Name: A, dtype: float64

In [40]:
df[:2]

          A         B         C         D         E
1  0.353445  0.566313 -1.555943  0.405757  0.520186
2 -0.329803  1.449756 -0.501198 -0.129646 -1.097650

In [41]:
df.head(2)

          A         B         C         D         E
1  0.353445  0.566313 -1.555943  0.405757  0.520186
2 -0.329803  1.449756 -0.501198 -0.129646 -1.097650

In [42]:
df.tail(3)

          A         B         C         D         E
3  0.190020 -0.691334 -2.016615  0.250103  1.639113
4  0.383322  1.420113  2.078265  1.021147 -0.688420
5  0.490292  0.035244  1.044593  2.606854  0.015239

In [49]:
df.A > 0.3

1     True
2    False
3    False
4     True
5     True
Name: A, dtype: bool

In [51]:
df.loc[df.A > 0.3]

          A         B         C         D         E
1  0.353445  0.566313 -1.555943  0.405757  0.520186
4  0.383322  1.420113  2.078265  1.021147 -0.688420
5  0.490292  0.035244  1.044593  2.606854  0.015239

In [56]:
df.loc[df.B > 0.5, ['D','E']]

          D         E
1  0.405757  0.520186
2 -0.129646 -1.097650
4  1.021147 -0.688420

In [52]:
df.iloc[0,1]

0.5663127960212397

In [53]:
df.iloc[:2]

          A         B         C         D         E
1  0.353445  0.566313 -1.555943  0.405757  0.520186
2 -0.329803  1.449756 -0.501198 -0.129646 -1.097650

In [54]:
df.iloc[:2, 2]

1   -1.555943
2   -0.501198
Name: C, dtype: float64